import pandas as pd
import numpy as np
from classify import classifier

#################################################################
#                                                               #
#                         导入恶意数据集                           #
#                                                               #
#################################################################

df1 = pd.read_csv('test.csv')
# test.csv数据集提前填充了100条数据，最后加入3组数据来自3个mac地址的，分别是无害、恶意和无害，因此预期结果为0、1、0

#################################################################
#                                                               #
#                   给数据集添加标签                               #
#                                                               #
#################################################################
df1.insert(7, "Is_malicious", 1)

if __name__ == '__main__':
    classifier(df1)